Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: The template is required to generate and preview a document.
th_th: จำเป็นต้องมีเทมเพลตเพื่อสร้างและแสดงตัวอย่างเอกสาร

source: Upload document
th_th: อัปโหลดเอกสาร

source: Browse to upload file
th_th: เรียกดูเพื่ออัปโหลดไฟล์

source: Supported file formats: PDF. Maximum file size: 10MB. Maximum number of files per upload: 1 file.
th_th: รูปแบบไฟล์ที่รองรับ: PDF. ขนาดไฟล์สูงสุด: 10MB. จำนวนไฟล์สูงสุดต่อการอัปโหลด: 1 ไฟล์.

source: The document "{{fileName}}" cannot be imported. Make it matches the format and size requirements.
th_th: ไม่สามารถนำเข้าเอกสาร "{{fileName}}" ได้ โปรดตรวจสอบให้เป็นไปตามข้อกำหนดด้านรูปแบบและขนาด

source: Generate & preview document
th_th: สร้างและแสดงตัวอย่างเอกสาร

source: To update this field, you must first delete the generated attached document.
th_th: หากต้องการอัปเดตฟิลด์นี้ คุณต้องลบเอกสารที่แนบซึ่งถูกสร้างขึ้นก่อน

source: Alerts
th_th: การแจ้งเตือน

source: Internal note
th_th: บันทึกภายใน

source: No files uploaded
th_th: ไม่ได้อัปโหลดไฟล์

source: Comm round
th_th: รอบการสื่อสาร

source: A date is required when an operator is selected
th_th: จำเป็นต้องระบุวันที่เมื่อมีการเลือกตัวดำเนินการ

source: Number of days
th_th: จำนวนวัน

source: An operator is required when a date or value is provided
th_th: จำเป็นต้องมีตัวดำเนินการเมื่อมีการระบุวันที่หรือค่า

source: Reference number
th_th: หมายเลขอ้างอิง

source: Type part of a reference number
th_th: พิมพ์บางส่วนของหมายเลขอ้างอิง

source: Type part of a request ID
th_th: พิมพ์บางส่วนของรหัสคำขอ

source: Resolution date
th_th: วันที่แก้ไขปัญหา

source: Since request
th_th: ตั้งแต่มีการร้องขอ

source: A value is required when an operator is selected
th_th: จำเป็นต้องระบุค่าเมื่อมีการเลือกตัวดำเนินการ

source: Type part of a name or worker ID
th_th: พิมพ์บางส่วนของชื่อหรือรหัสพนักงาน

source: The reference number cannot be empty.
th_th: หมายเลขอ้างอิงต้องไม่เว้นว่าง

source: The reference number cannot be longer than 50 characters.
th_th: หมายเลขอ้างอิงต้องมีความยาวไม่เกิน 50 ตัวอักษร

source: The request date cannot be empty.
th_th: วันที่คำขอห้ามเว้นว่าง

source: The request date cannot be in the future.
th_th: วันที่คำขอไม่สามารถเป็นวันที่ในอนาคตได้

source: Request details
th_th: รายละเอียดคำร้องขอ

source: Response to requester
th_th: การตอบกลับถึงผู้ร้องขอ

source: Response to worker
th_th: การตอบกลับถึงพนักงาน

source: Select data source
th_th: เลือกแหล่งข้อมูล

source: Select template
th_th: เลือกเทมเพลต

source: Send & close
th_th: ส่งและปิด

source: You are about to close this pay information request. This action is irreversible. The document will be added to the selected communication round. Are you sure you want to proceed?
th_th: คุณกำลังจะปิดคำขอข้อมูลค่าจ้างนี้ การดำเนินการนี้ไม่สามารถย้อนกลับได้ เอกสารจะถูกเพิ่มไปยังรอบการสื่อสารที่เลือกไว้ คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?

source: Confirm closing request
th_th: ยืนยันคำขอปิด

source: If you close now, request will be saved and the document won't be added.
th_th: หากคุณปิดตอนนี้ คำขอจะถูกบันทึกไว้ แต่เอกสารจะไม่ถูกเพิ่ม

source: Close without adding a document
th_th: ปิดโดยไม่เพิ่มเอกสาร

source: The pay information request was successfully closed.
th_th: คำขอข้อมูลค่าจ้างถูกปิดเรียบร้อยแล้ว

source: Workflow is enabled for the selected communication round. The attached document will be added but won't be visible by the worker until it is released
th_th: มีการเปิดใช้งานเวิร์กโฟลว์สำหรับรอบการสื่อสารที่เลือกไว้แล้ว เอกสารที่แนบมาจะถูกเพิ่มเข้าไป แต่พนักงานจะยังไม่สามารถมองเห็นได้จนกว่าจะถูกเผยแพร่

source: Workflow enabled
th_th: เปิดใช้งานเวิร์กโฟลว์

source: Approaching deadline
th_th: ใกล้กำหนดส่ง

source: Closed without document
th_th: ปิดโดยไม่มีเอกสาร

source: Document deleted
th_th: ลบเอกสารแล้ว

source: Not released to worker
th_th: ยังไม่ได้เผยแพร่ให้พนักงาน

source: Overdue
th_th: เกินกำหนด

source: Remove filters and clear the search to show all results.
th_th: ลบตัวกรองและล้างการค้นหาเพื่อแสดงผลลัพธ์ทั้งหมด

source: Your pay information requests will appear here. Check back later for updates or explore more features in the meantime.
th_th: คำขอข้อมูลค่าจ้างของคุณจะแสดงที่นี่ โปรดกลับมาตรวจสอบอีกครั้งในภายหลังเพื่อดูอัปเดต หรือสำรวจฟีเจอร์อื่น ๆ ระหว่างรอ

source: API upload
th_th: อัปโหลด API

source: {{count}} day
th_th: {{count}} วัน

source: {{count}} days
th_th: {{count}} วัน

source: Reopened
th_th: เปิดใหม่อีกครั้ง

source: Manage pay information requests.
th_th: จัดการคำขอข้อมูลค่าตอบแทน

source: Pay information requests
th_th: คำขอข้อมูลค่าตอบแทน

source: Technical account (API upload)
th_th: บัญชีเทคนิค (อัปโหลด API)

source: View request
th_th: ดูคำขอ

source: The worker cannot be empty.
th_th: ไม่สามารถเว้นช่องพนักงานว่างได้

source: Create prediction
th_th: สร้างการคาดการณ์

source: There are no predictions to display at the moment.
th_th: ไม่มีการคาดการณ์ให้แสดงในขณะนี้

source: My prediction list
th_th: รายการการคาดการณ์ของฉัน

source: Created date: {{date}}
th_th: วันที่สร้าง: {{date}}

source: Created date: {{createDate}} Updated: {{modifiedDate}}
th_th: วันที่สร้าง: {{createDate}} อัปเดตเมื่อ: {{modifiedDate}}

source: No predictions with the name "{{phrase}}"
th_th: ไม่มีการคาดการณ์ด้วยชื่อ "{{phrase}}"

source: Search prediction
th_th: การคาดการณ์การค้นหา

source: Here you can find a list of system-generated salary proposals that consider factors like salary ranges and promotion levels to support external competitiveness and internal equity.
th_th: ที่นี่ คุณจะพบรายการข้อเสนอเงินเดือนที่ระบบสร้างขึ้น ซึ่งพิจารณาปัจจัยต่างๆ เช่น ช่วงเงินเดือนและระดับการเลื่อนตำแหน่ง เพื่อสนับสนุนความสามารถในการแข่งขันภายนอกและความเสมอภาคภายใน

source: Existing worker
th_th: พนักงานที่มีอยู่

source: New hire
th_th: การจ้างพนักงานใหม่

source: There are no feedback types available for this worker. Share your thoughts to help your team members grow.
th_th: ไม่มีประเภทฟีดแบคสำหรับพนักงานรายนี้ โปรดแบ่งปันความคิดเห็นของคุณเพื่อช่วยให้สมาชิกในทีมของคุณเติบโต

source: Shared with me
th_th: แบ่งปันกับฉัน

source: Average: {{avg}}
th_th: ค่าเฉลี่ย: {{avg}}

source: Based on evaluations provided by workers
th_th: ตามการประเมินจากพนักงาน

source: Give feedback to increase the chances of generating insights.
th_th: ให้ฟีดแบคเพื่อเพิ่มโอกาสในการสร้างข้อมูลเชิงลึก

source: {{count}} rated feedback to generate statistics
th_th: ฟีดแบคที่ได้รับการจัดอันดับเพื่อสร้างสถิติ {{count}} รายการ

source: Perceived <strong>clarity</strong>
th_th: รับรู้ <strong>ความชัดเจน</strong>

source: Perceived <strong>trust</strong>
th_th: รับรู้ <strong>ความไว้วางใจ</strong>

source: Rated feedback
th_th: ฟีดแบคที่ได้รับการจัดอันดับ

source: Manager feedback ratings
th_th: การให้คะแนนฟีดแบคของหัวหน้างาน

source: Until the next update
th_th: จนกว่าจะมีการอัปเดตครั้งต่อไป

source: Feedback marked as public by this worker
th_th: ฟีดแบคที่ทำเครื่องหมายเป็นสาธารณะโดยพนักงานคนนี้

source: Check again later for updates or explore more in the meantime.
th_th: ตรวจสอบอีกครั้งในภายหลังสำหรับการอัปเดตหรือสำรวจเพิ่มเติมในระหว่างนี้

source: Feedback that was sent to this worker
th_th: ฟีดแบคที่ส่งถึงพนักงานคนนี้

source: You haven’t sent any feedback to this worker yet. Share your thoughts to help your team members grow.
th_th: คุณยังไม่ได้ส่งฟีดแบคถึงพนักงานคนนี้ โปรดแบ่งปันความคิดเห็นของคุณเพื่อช่วยให้สมาชิกในทีมของคุณเติบโต

source: {{firstName}} is waiting for your feedback. Why not share your insights now?
th_th: {{firstName}} กำลังรอฟีดแบคจากคุณอยู่ ทำไมไม่แชร์ความคิดเห็นของคุณตอนนี้ล่ะ

source: Feedback this team member shared with me
th_th: ฟีดแบคที่สมาชิกทีมคนนี้แบ่งปันกับฉัน

source: Sharing feedback helps improve teamwork and processes within the company.
th_th: การแบ่งปันฟีดแบคช่วยปรับปรุงการทำงานเป็นทีมและกระบวนการต่างๆ ภายในบริษัท

source: Goals owned by your team member and on which they need to work.
th_th: เป้าหมายที่เป็นของสมาชิกในทีมของคุณและพวกเขาต้องดำเนินการ

source: No results.<br/>Clear search to show all goals.
th_th: ไม่มีผลลัพธ์ <br/> ล้างการค้นหาเพื่อแสดงเป้าหมายทั้งหมด

source: This team member has no goals yet.
th_th: สมาชิกทีมนี้ยังไม่มีเป้าหมาย

source: This team member has no assigned performance review at the moment.
th_th: ขณะนี้สมาชิกทีมคนนี้ยังไม่ได้รับมอบหมายการประเมินผลการปฏิบัติงาน

source: Career development
th_th: แผนพัฒนาความก้าวหน้าในสายอาชีพ

source: Reassigned to: {{userName}}
th_th: มอบหมายใหม่ให้กับ: {{userName}}

source: Go to career development plan
th_th: ไปที่แผนพัฒนาสายอาชีพ

source: Reassigned
th_th: ถูกมอบหมายใหม่

source: Reassigned to {{userName}}
th_th: โอนให้ {{userName}} แล้ว

source: Compare workers
th_th: เปรียบเทียบพนักงาน

source: Direct reports
th_th: ผู้ใต้บังคับบัญชา

source: {{firstName}}'s goal progress
th_th: ความคืบหน้าเป้าหมายของ {{firstName}}

source: Last feedback
th_th: ฟีดแบคล่าสุด

source: No feedback
th_th: ไม่มีฟีดแบค

source: (me)
th_th: (ฉัน)

source: Next check-in
th_th: การเช็คอินครั้งต่อไป

source: No check-ins
th_th: ไม่มีการเช็คอิน

source: Go to check-in
th_th: ไปที่การเช็คอิน

source: Go to review
th_th: ไปที่การประเมินผลงาน

source: No team members match your criteria. Try adjusting your search or check the spelling and filters to find the right team member.
th_th: ไม่มีสมาชิกในทีมที่ตรงตามเกณฑ์ของคุณ ลองปรับการค้นหาของคุณหรือตรวจสอบการสะกดคำและตัวกรองเพื่อค้นหาสมาชิกในทีมที่ถูกต้อง

source: No team members selected
th_th: ไม่มีการเลือกสมาชิกทีม

source: Select one or more team members to view their performance metrics. Check the box next to their name to analyze their data.
th_th: เลือกสมาชิกทีมหนึ่งคนหรือมากกว่านั้นเพื่อดูตัวชี้วัดประสิทธิภาพการทำงานของพวกเขา ทำเครื่องหมายที่ช่องข้างชื่อของพวกเขาเพื่อวิเคราะห์ข้อมูลของพวกเขา

source: Direct reports of {{name}}
th_th: รายงานโดยตรงของ {{name}}

source: Team view
th_th: มุมมองทีม

source: Top behavior
th_th: พฤติกรรมยอดนิยม

source: No behaviors
th_th: ไม่มีพฤติกรรม

source: You don't have any direct reports
th_th: คุณไม่มีรายงานโดยตรง

source: Worker tree
th_th: แผนผังพนักงาน

source: Search for a recipient
th_th: ค้นหาผู้รับ

source: No recipients with the name "{{phrase}}"
th_th: ไม่มีผู้รับที่มีชื่อ " {{phrase}} "

source: This table displays a comprehensive list of documents associated with your team. You can preview, download and release these documents here. Please ensure the accuracy and relevance of each document before approving.
th_th: ตารางนี้แสดงรายการเอกสารที่เกี่ยวข้องกับทีมของคุณอย่างครบถ้วน คุณสามารถดูตัวอย่าง ดาวน์โหลด และเผยแพร่เอกสารเหล่านี้ได้ที่นี่ โปรดตรวจสอบความถูกต้องและความเกี่ยวข้องของเอกสารแต่ละรายการก่อนการอนุมัติ

source: {{selectedItemsCount}} items selected
th_th: {{selectedItemsCount}} รายการที่เลือก

source: Select all {{allAvailableDocumentsCount}} items
th_th: เลือกทั้งหมด {{allAvailableDocumentsCount}} รายการ

source: Communication rounds
th_th: รอบการสื่อสาร

source: View and manage team documents.
th_th: ดูและจัดการเอกสารของทีม

source: You have not accessed any communication rounds yet.
th_th: คุณยังไม่ได้เข้าถึงรอบการสื่อสารใดๆ

source: No communication rounds
th_th: ไม่มีรอบการสื่อสาร

source: Communication manager review
th_th: การประเมินผลงานของหัวหน้างานฝ่ายการสื่อสาร

source: Communication round list
th_th: รายการรอบการสื่อสาร

source: HR BP review
th_th: การตรวจสอบ HR BP

source: Document released automatically
th_th: เอกสารถูกเผยแพร่อัตโนมัติ

source: <strong>{{name}}</strong> changed the workflow step
th_th: <strong>{{name}}</strong> ได้เปลี่ยนขั้นตอนของเวิร์กโฟลว์

source: Document imported
th_th: นำเข้าเอกสารแล้ว

source: <strong>{{name}}</strong> imported the document
th_th: <strong>{{name}}</strong> ได้นำเข้าเอกสาร

source: Document overridden
th_th: เอกสารถูกแทนที่

source: <strong>{{name}}</strong> overrode the document
th_th: <strong>{{name}}</strong> ได้แทนที่เอกสาร

source: Document details
th_th: รายละเอียดเอกสาร

source: Recipient
th_th: ผู้รับ

source: <strong>{{name}}</strong> imported the document from the pay information request {{requestId}}
th_th: <strong>{{name}}</strong> ได้นำเข้าเอกสารจากคำขอข้อมูลค่าตอบแทน {{requestId}}

source: <strong>{{name}}</strong> released the document
th_th: <strong>{{name}}</strong> ได้เผยแพร่เอกสารนี้

source: <strong>{{name}}</strong> unreleased the document
th_th: <strong>{{name}}</strong> ได้ยกเลิกการเผยแพร่เอกสาร

source: <strong>{{name}}</strong> viewed the document
th_th: <strong>{{name}}</strong> ดูเอกสารแล้ว

source: Unrelease
th_th: ยกเลิกการเผยแพร่

source: Download document
th_th: ดาวน์โหลดเอกสาร

source: Import
th_th: นำเข้า

source: The document was successfully canceled.
th_th: เอกสารถูกยกเลิกสำเร็จแล้ว

source: The workflow step was successfully changed.
th_th: ขั้นตอนเวิร์กโฟลว์ได้รับการเปลี่ยนแปลงสำเร็จแล้ว

source: The document was successfully deleted.
th_th: เอกสารถูกลบสำเร็จแล้ว

source: The document was successfully released.
th_th: เอกสารได้รับการเผยแพร่สำเร็จแล้ว

source: One or more validation errors occurred. Some document are not in the proper workflow step for the requested action. Please, refresh the page.
th_th: เกิดข้อผิดพลาดในการตรวจสอบความถูกต้องหนึ่งรายการหรือมากกว่า เอกสารบางรายการไม่ได้อยู่ในขั้นตอนเวิร์กโฟลว์ที่ถูกต้องสำหรับการดำเนินการที่ร้องขอ กรุณารีเฟรชหน้าเพจ

source: Release document
th_th: เผยแพร่เอกสาร

source: View document
th_th: ดูเอกสาร

source: Change workflow step
th_th: เปลี่ยนแปลงขั้นตอนเวิร์กโฟลว์

source: Add filter criteria
th_th: เพิ่มเกณฑ์การกรอง

source: Advanced filters
th_th: ตัวกรองขั้นสูง

source: Filter
th_th: ตัวกรอง

source: Region
th_th: ภูมิภาค

source: State
th_th: รัฐ

source: Select fields & values
th_th: เลือกฟิลด์และค่า

source: Comm manager: {{count}} filter applied
th_th: ผู้จัดการการสื่อสาร: ใช้ตัวกรองแล้ว {{count}} รายการ

source: Comm manager: {{count}} filters applied
th_th: ผู้จัดการการสื่อสาร: มีการใช้ตัวกรอง {{count}} รายการ

source: Recipient: {{count}} filter applied
th_th: ผู้รับ: ใช้ตัวกรอง {{count}} ตัวแล้ว

source: Recipient: {{count}} filters applied
th_th: ผู้รับ: มีการใช้ตัวกรอง {{count}} รายการ

source: Comm manager
th_th: ผู้จัดการฝ่ายสื่อสาร

source: Values
th_th: ค่านิยม

source: Target workflow step
th_th: ขั้นตอนเวิร์กโฟลว์เป้าหมาย

source: Release
th_th: เผยแพร่

source: Do you want to release {{selectedRowKeysLength}} out of {{allAvailableDocumentsCount}} selected documents? Only not released documents that are in "Document review" step will be released.
th_th: คุณต้องการเผยแพร่เอกสารที่เลือก {{selectedRowKeysLength}} จากทั้งหมด {{allAvailableDocumentsCount}} รายการหรือไม่ เฉพาะเอกสารที่ยังไม่ได้เผยแพร่และอยู่ในขั้นตอน "ตรวจสอบเอกสาร" เท่านั้นที่จะถูกเผยแพร่

source: You cannot release the documents. The selected documents have already been released.
th_th: คุณไม่สามารถเผยแพร่เอกสารได้ เอกสารที่เลือกถูกเผยแพร่ไปแล้ว

source: {{releasedDocumentsLength}} of the {{selectedRowKeysLength}} documents are already released. Do you want to release the other documents?
th_th: เอกสาร {{releasedDocumentsLength}} จากทั้งหมด {{selectedRowKeysLength}} รายการได้รับการเผยแพร่แล้ว คุณต้องการเผยแพร่เอกสารฉบับอื่นหรือไม่

source: Do you want to release {{selectedRowKeysLength}} documents?
th_th: คุณต้องการที่จะเผยแพร่เอกสาร {{selectedRowKeysLength}} หรือไม่

source: Documents already released
th_th: เอกสารเผยแพร่แล้ว

source: {{SucceededCount}} of {{RequestedCount}} documents were successfully released. Documents that are already released and documents that are not in "Document review" step cannot be released.
th_th: เผยแพร่เอกสาร {{SucceededCount}} จาก {{RequestedCount}} รายการเรียบร้อยแล้ว ไม่สามารถเผยแพร่เอกสารที่เผยแพร่แล้วและเอกสารที่ไม่ได้อยู่ในขั้นตอน "ตรวจสอบเอกสาร" ได้

source: {{SucceededCount}} of {{RequestedCount}} documents were successfully released.
th_th: เอกสาร {{SucceededCount}} จาก {{RequestedCount}} ฉบับถูกปล่อยสำเร็จ

source: {{FailedLength}} of {{RequestedCount}} selected documents cannot be released. Only not released documents that are in "Document review" step can be released.
th_th: ไม่สามารถเผยแพร่เอกสารที่เลือก {{FailedLength}} จาก {{RequestedCount}} รายการได้ สามารถเผยแพร่ได้เฉพาะเอกสารที่ยังไม่ได้เผยแพร่ซึ่งอยู่ในขั้นตอน "ตรวจสอบเอกสาร" เท่านั้น

source: {{selectedDocsLength}} documents selected:
th_th: เลือกเอกสารแล้ว {{selectedDocsLength}} รายการ:

source: Do you want to unrelease {{selectedRowKeysLength}} out of {{allAvailableDocumentsCount}} selected documents? Only released documents will be unreleased.
th_th: คุณต้องการยกเลิกการเผยแพร่เอกสารที่เลือก {{selectedRowKeysLength}} จากทั้งหมด {{allAvailableDocumentsCount}} รายการหรือไม่ เฉพาะเอกสารที่เผยแพร่แล้วเท่านั้นที่จะถูกยกเลิกการเผยแพร่ได้

source: You cannot unrelease files that are in "Unreleased" and "Not released" status.
th_th: คุณไม่สามารถยกเลิกการเผยแพร่ไฟล์ที่มีสถานะ “ยกเลิกการเผยแพร่” และ “ไม่ได้เผยแพร่” ได้

source: You cannot unrelease the files. The selected files have not been released yet.
th_th: คุณไม่สามารถยกเลิกการเผยแพร่ไฟล์ได้ ไฟล์ที่เลือกยังไม่ได้ถูกเผยแพร่

source: You cannot unrelease the files. The selected files have already been unreleased.
th_th: คุณไม่สามารถยกเลิกการเผยแพร่ไฟล์ได้ ไฟล์ที่เลือกได้รับการยกเลิกการเผยแพร่แล้ว

source: {{unReleasedDocumentsLength}} of the {{selectedRowKeysLength}} are already unreleased. Do you want to unrelease the other documents?
th_th: {{unReleasedDocumentsLength}} จาก {{selectedRowKeysLength}} รายการถูกยกเลิกการเผยแพร่แล้ว คุณต้องการยกเลิกการเผยแพร่เอกสารอื่นหรือไม่

source: Do you want to unrelease {{selectedRowKeysLength}} documents?
th_th: คุณต้องการยกเลิกการเผยแพร่เอกสาร {{selectedRowKeysLength}} หรือไม่

source: Documents already unreleased
th_th: เอกสารที่ยกเลิกการเผยแพร่แล้ว

source: Unrelease impossible
th_th: ไม่สามารถยกเลิกการเผยแพร่ได้

source: Files not released
th_th: ไฟล์ไม่ได้ถูกเผยแพร่ออกมา

source: {{SucceededCount}} of {{RequestedCount}} documents were successfully unreleased. Documents that are not released cannot be unreleased.
th_th: ยกเลิกการเผยแพร่เอกสาร {{SucceededCount}} จาก {{RequestedCount}} รายการเรียบร้อยแล้ว ไม่สามารถยกเลิกการเผยแพร่เอกสารที่ไม่ได้เผยแพร่ได้

source: {{SucceededCount}} of {{RequestedCount}} documents were successfully unreleased.
th_th: เอกสาร {{SucceededCount}} จาก {{RequestedCount}} ฉบับถูกยกเลิกการปล่อยสำเร็จ

source: {{FailedLength}} of {{RequestedCount}} selected documents cannot be unreleased. Only released documents can be unreleased.
th_th: ไม่สามารถยกเลิกการเผยแพร่เอกสารที่เลือก {{FailedLength}} จาก {{RequestedCount}} รายการได้ สามารถยกเลิกการเผยแพร่เฉพาะเอกสารที่เผยแพร่แล้วเท่านั้น

source: My summary document
th_th: เอกสารสรุปของฉัน

source: Generation date
th_th: วันที่ผลิต

source: Document recipient
th_th: ผู้รับเอกสาร

source: Release status
th_th: สถานะการเผยแพร่

source: My summary doc
th_th: เอกสารสรุปของฉัน

source: Are you sure you want to cancel the release of the selected documents?
th_th: คุณแน่ใจหรือไม่ว่าต้องการยกเลิกการเผยแพร่เอกสารที่เลือก

source: Unrelease selected documents
th_th: ยกเลิกการเผยแพร่เอกสารที่เลือก

source: Are you sure you want to delete the selected documents?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบเอกสารที่เลือก

source: Delete documents
th_th: ลบเอกสาร

source: Are you sure you want to release the selected documents?
th_th: คุณแน่ใจหรือไม่ว่าต้องการเผยแพร่เอกสารที่เลือก

source: Release selected documents
th_th: เผยแพร่เอกสารที่เลือก

source: Communication manager name
th_th: ชื่อหัวหน้างานฝ่ายการสื่อสาร

source: Type part of a name
th_th: พิมพ์ส่วนหนึ่งของชื่อ

source: Generated after
th_th: สร้างขึ้นหลังจาก

source: Generated before
th_th: สร้างขึ้นก่อน

source: Remove filters and the clear the search to show all results.
th_th: ลบตัวกรองและล้างการค้นหาเพื่อแสดงผลลัพธ์ทั้งหมด

source: Recipient name
th_th: ชื่อผู้รับ

source: Do you want to change the workflow step of {{selectedRowKeysLength}} out of {{allAvailableDocumentsCount}} selected documents? Only selected rows that are not in "{{TargetStep}}" step will be moved. You must unrelease released documents to be able to move them along in the workflow.
th_th: คุณต้องการเปลี่ยนขั้นตอนเวิร์กโฟลว์ของเอกสารที่เลือกหรือไม่ เฉพาะแถวที่เลือกซึ่งไม่อยู่ในขั้นตอน {{TargetStep}} เท่านั้นที่จะถูกย้าย คุณต้องยกเลิกการเผยแพร่เอกสารที่เผยแพร่แล้วจึงจะสามารถย้ายเอกสารเหล่านี้ไปตามเวิร์กโฟลว์ได้

source: Change workflow step of selected documents
th_th: เปลี่ยนแปลงขั้นตอนเวิร์กโฟลว์ของเอกสารที่เลือก

source: You cannot change the workflow step of the selected documents.
th_th: คุณไม่สามารถเปลี่ยนขั้นตอนเวิร์กโฟลว์ของเอกสารที่เลือกได้

source: Workflow step change impossible
th_th: การเปลี่ยนแปลงขั้นตอนเวิร์กโฟลว์เป็นไปไม่ได้

source: {{SucceededCount}} of {{RequestedCount}} documents were successfully moved to the next workflow step.
th_th: เอกสาร {{SucceededCount}} จาก {{RequestedCount}} รายการได้รับการย้ายไปยังขั้นตอนเวิร์กโฟลว์ถัดไปเรียบร้อยแล้ว

source: {{FailedLength}} of the {{RequestedCount}} selected documents cannot be changed at the moment. Please try again later.
th_th: ไม่สามารถเปลี่ยนแปลงเอกสารที่เลือก {{FailedLength}} จาก {{RequestedCount}} รายการได้ในขณะนี้ โปรดลองอีกครั้งในภายหลัง

source: Release impossible. The selected documents have already been released.
th_th: ไม่สามารถเผยแพร่ได้ เอกสารที่เลือกได้รับการเผยแพร่ไปแล้ว

source: Do you want to release {{selectedRowKeysLength}} selected documents?
th_th: คุณต้องการที่จะเผยแพร่เอกสารที่เลือก {{selectedRowKeysLength}} รายการหรือไม่

source: {{SucceededCount}} of {{RequestedCount}} documents were successfully released. Documents that are already released and documents that are not in 'Document Review' step cannot be released.
th_th: เผยแพร่เอกสาร {{SucceededCount}} จาก {{RequestedCount}} รายการเรียบร้อยแล้ว ไม่สามารถเผยแพร่เอกสารที่เผยแพร่แล้วและเอกสารที่ไม่ได้อยู่ในขั้นตอน 'ตรวจสอบเอกสาร' ได้

source: {{FailedLength}} of the {{RequestedCount}} selected documents cannot be released. Only not released documents that are in "Document review" step can be released.
th_th: ไม่สามารถเผยแพร่เอกสาร {{FailedLength}} จาก {{RequestedCount}} รายการได้ สามารถเผยแพร่ได้เฉพาะเอกสารที่อยู่ในขั้นตอน "ตรวจสอบเอกสาร" เท่านั้น

source: Do you want unrelease {{selectedRowKeysLength}} out of {{allAvailableDocumentsCount}} selected documents? Only released documents will be unreleased.
th_th: คุณต้องการยกเลิกการเผยแพร่เอกสารที่เลือก {{selectedRowKeysLength}} รายการจากทั้งหมด {{allAvailableDocumentsCount}} รายการหรือไม่ เฉพาะเอกสารที่เผยแพร่แล้วเท่านั้นที่จะถูกยกเลิกการเผยแพร่

source: You cannot unrelease files in "Unreleased" and "Not released" status.
th_th: คุณไม่สามารถยกเลิกการเผยแพร่ไฟล์ที่มีสถานะ “ยกเลิกการเผยแพร่” และ “ไม่ได้เผยแพร่” ได้

source: You cannot unrelease the files; the selected files haven't been released yet.
th_th: คุณไม่สามารถยกเลิกการเผยแพร่ไฟล์ได้ เนื่องจากไฟล์ที่เลือกยังไม่ได้รับการเผยแพร่

source: You cannot unrelease files. The selected files have already been unreleased.
th_th: คุณไม่สามารถยกเลิกการเผยแพร่ไฟล์ได้ ไฟล์ที่เลือกได้รับการยกเลิกการเผยแพร่แล้ว

source: {{unReleasedDocumentsLength}} of the {{selectedRowKeysLength}} selected documents are already unreleased. Do you want to unrelease the other documents?
th_th: เอกสารที่เลือกไว้ {{unReleasedDocumentsLength}} จากทั้งหมด {{selectedRowKeysLength}} รายการยังไม่ได้เผยแพร่ คุณต้องการยกเลิกการเผยแพร่เอกสารฉบับอื่นหรือไม่

source: Do you want to unrelease {{selectedRowKeysLength}} selected document(s)?
th_th: คุณต้องการยกเลิกการเผยแพร่เอกสารที่เลือก {{selectedRowKeysLength}} รายการหรือไม่

source: {{FailedLength}} of the {{RequestedCount}} selected documents cannot be unreleased. Only released documents can be unreleased.
th_th: ไม่สามารถยกเลิกการเผยแพร่เอกสารที่เลือก {{FailedLength}} จาก {{RequestedCount}} รายการได้ เฉพาะเอกสารที่เผยแพร่แล้วเท่านั้นที่สามารถยกเลิกการเผยแพร่ได้

source: No manager
th_th: ไม่มีหัวหน้างาน

source: Managers
th_th: ผู้จัดการ

source: Communication manager
th_th: หัวหน้างานฝ่ายการสื่อสาร

source: Supported file formats: PDF. Maximum file size: 20MB.
th_th: รูปแบบไฟล์ที่รองรับ: PDF ขนาดไฟล์สูงสุด: 20MB
